laught_add="""
你是专业的内涵段子生成大师.
请你仔细分析男生的癖好，合理选择不同人生阶段时刻可能的表现，生成一个内涵搞笑段子：
-强烈对比：通过对比不同情境下的行为或态度，可以产生幽默效果。
-固执的癖好：一直做某件事没做成，或者一直做某件事
-简洁明了：段子应该简短有力，避免冗长的叙述，让观众能够快速抓住笑点。

男生的癖好：
{}

可能的人生阶段的时刻：
青春、上中学、体验第一次恋爱、发展个人兴趣
青年、追求高等教育、开始职业生涯、建立人际关系
成年、稳定工作、结婚、养育子女
中年、职业发展、子女教育、家庭责任
老年、退休、享受休闲活动、与孙辈互动
死亡、生命终结
地府、接受审判 往生回顾 

<案例1>
背景，搞笑视频 男生对抽烟的癖好
1、早上起床 男生：我来根小烟 
2、中午 男生：吃饭完 我来跟小烟 
3、晚上加完班 男生：我来跟小烟
</案例1>
<案例2>
背景，搞笑视频 男人的一生
1、幼年：妈妈我错了
2、青年：宝宝我错了
3、中年：老婆我错了
3、老年：孙女爷爷错了
</案例2>
"""


jok="""
幽默有两个基本特点：(1)必须有趣味性。即是说幽默必须具有美感特征，如果只是一味地用来讽刺他人而使自己畅快，却忽略了他人的感受，那样的幽默会造成他人的厌恶与反感。
(2)必须意味深长。幽默的智慧性来自于自身深刻的生活体验、敏锐的洞察力、丰富的想象力、良好的素养与语言表达能力，以及优雅的风度与乐观的情绪。

1　答非所问答非所问，也就是打岔。打岔可以营造出一种简单但荒诞有趣的对话环境。提问一方不断被打岔后的无奈、妥协与最后不得不放弃，都是笑点所在。
例子：
台湾综艺节目《我猜我猜我猜猜猜》中，主持人阿雅问吴宗宪：“你跟康康哪个比较搞笑？”（康康和吴宗宪都是搞笑艺人）吴宗宪回答说：“他比较可笑。”
记者：“大爷，大娘给您做了一桌子菜，您感动吗？”大爷：“我不敢动啊，每次都是她先动我才敢动。”
夏洛：“大爷，楼上322住的是马冬梅家吧？”大爷：“马冬什么？”夏洛：“马冬梅。”大爷：“什么冬梅啊？”夏洛：“马冬梅啊。”大爷：“马什么梅啊？”夏洛：“行，大爷你先凉快吧。”大爷：“好嘞。”

2 避重就轻避重就轻，就是不顺着对方的话讲，故意曲解前一句话中的重点词语，把重点放到与人们日常理解不一样的词语上，怎么歪怎么来，让人们听到后产生意外感，从而具有幽默的效果。
避重就轻这个技巧的关键，是把前一个句子中人们习惯了的关键词，换成另一个不常用的关键词，
例子：
冬天大雁为什么要飞到南方过冬？因为走过去太远了。
你：房子又漏雨了！房东：就你交的这点房租，难道还想漏香槟吗？你：你的房子这么差，还要求押一付三？房东：因为押一付五不合法。

3　重新定义
重新定义就是把人们习惯中已经约定俗成的固定定义，用另外一套逻辑重新解释出来。被重新定义最多的就是成语和俗语。这些成语和俗语，通过另一个逻辑解释出来的时候，一下子冲破了人们对这个词语原有的固定认知，产生出很强的意外感，幽默由此产生。
例子：
有一年我们商学院有同学毕业，我们做了个吐槽大会。对其中一位同学的吐槽是：“这是位德艺双馨的艺术家，他得意扬扬的样子就好像是刚刚发了双薪。（，“德艺双馨”被重新定义为“得意双薪”）”
我参加过一个学习，第一名的同学最后会获得学院的一个奖励，就是明星老师的VIP（贵宾）私房课。主持人开玩笑说：“什么是私房课呢？就是到私人的房子里去上课。”

4　先躺枪再甩锅
躺枪就是前面你可以正经地批评一件事，义正词严。然后在结尾的地方一拐弯，把锅甩给一个毫无防备的人。
例子：
何洁曾经放狠话，说她要是瘦不下来就退出娱乐圈，我说你不要这样，你在娱乐圈进进出出不太好，这个娱乐圈的通道就这么窄，就因为你，苏醒现在都没进去。——《吐槽大会》创始人一出事就会导致公司市值掉几百亿，这提醒我们企业做大做强之后，企业家本身的自我约束力也得提升，否则很容易对企业造成巨大的损失。你说是吧，孙总？大家可以记住这个躺枪的经典句型——“你说是吧”。

5　声东击西
声东击西，就是前面说一件事，后面说另一件事。也就是在说的过程中，打断已有的强逻辑关联，冒出一个弱逻辑关联。
例子：
在饭店就餐时，有人这样点菜：这个葱爆羊肉看起来真好吃，这个红烧鱼也不错，这个小鸡炖蘑菇挺诱人，我们点一个水晶肘子吧。声东击西的两件事之间，是有一定联系的。

6　谐音梗
谐音梗属于入门级别的技巧，简单易懂。谐音梗用于故意制造误会，继而产生出幽默的效果。误会是喜剧中一个很常用的套路，无论是在相声中，还是网上的段子中，如果是误会套路的，很多都是用谐音梗创作出来的。
例子：
一天店里新来了个女服务员，店领导一到店里就说：“人呢？茶！”服务员赶紧数：“1、2、3、4、5、6、7，报告领导，7个人。”领导怒了，说：“倒茶！！”服务员再数：“7、6、5、4、3、2、1，还是7个，领导。”领导很无奈地说：“你数啥！”服务员回答：“我属狗”。
A：王菲是不是暗恋哪吒呀？B：为什么这么说？A：因为常听她唱：想你时你在闹海……

7　用暗示留白
当一句幽默的话从你嘴里说出来，要等听众经过大脑反应之后，才会表现出好笑或者不好笑的状态。正因为如此，有些笑点不需要直接表述出来，可以利用暗示，给观众留下想象的余地。这种留白打造的含蓄笑点，总是能够令人会心一笑。将中间内容留给听众去自我分析，让大家自己找到笑点
例子：
几个朋友聚会，聊到关于自己最讨厌的人或事，其中一个朋友开玩笑说：“我最讨厌比我还帅的人。”另一位补刀问他：“那我们这群人不都是你讨厌的对象？”


8　三段式
三段式，就是在你的段子中有一组东西，我们暂且称它们为A、B、C，其中A和B属于同一类，这样可以让观众形成一个预期，然后你给一个不同类的C，观众就会因为意外而发笑。
三段式的特点在于，经过一层一层的铺垫，可以激发听众的好奇心，让他们对最终的结果产生期待。同时，也可以通过前面两段的叙述，让听众对故事的结果形成一定的预期，然后我们再用第三段打破预期
使用逻辑性三段式叙述方法的时候，我们可以通过事件拆分的方式进行训练，将事件的经过分成A、B、C三个阶段。先用A、B形成预期，然后用C来打破预期。在进行A、B阶段的叙述时，要注意描述的吸引力，如果在铺垫阶段没有抓住听者的注意力，那么段子的效果肯定会大打折扣。
例子：
空姐在头等舱分发饮料。她问一个很有魅力的男乘客：“您是要咖啡、茶，还是我？”
我们很尊重创业者，尽量满足他们的需求。他们说要400万，我们就给400万，他们说要800万，我们就给800万，他们说要2000万，我们就说：“哥们儿，我们算了下，你需要800万。”

三段式可以跟其他技巧叠加使用，“三段式+谐音梗”的例子
这玩意儿别头上就是头花，别领子上就是领花，别腰上就是腰花。

9　头韵和尾韵
头韵和尾韵是押韵的一种，指的是在铺垫中找一个词，在包袱中使用与这个词当中的一个字相同的一个词。最常见的是压尾韵，
例子：
人生没有如果，只有后果和结果。(铺垫中是“如果”，包袱中用了“后果”和“结果”的尾韵。头韵就是铺垫中的连接词和包袱中的笑点词首字相同。)
那个让你心动的人，结婚后可能会让你心梗。
我们是处对象，又不是处钱。


10　词语叠用
中国汉字的魅力在于，同样的字在不同的情境下，代表的意思也不尽相同。尤其在一句话里，高密度重复使用同一个词，总是会让人听得晕头转向，进而被这种絮絮叨叨的描述和自己产生的困扰逗笑。
这种词语叠用的描述方式，如果以书面化的形式展示，不足以表现它的笑点；相反，若搭配语速较快的口语表达，则能展示它的幽默效果。
例子：
亲密关系有四种：你懂他他也懂你，你懂他他不懂你，你不懂他他懂你，你不懂他他也不懂你。在这句话中，“你”“懂”“他”这三个关键词在不断地重复和叠用，在不仔细深究的情况下，很难一下子明白其中的含义。
小王想给自己媳妇调动工作，于是拿出红包塞给领导，说：“这是我的一点意思”。领导说：“你这是什么意思？”小王说：“我就想意思意思。”领导说：“你这样做就没意思了。”
今晚是神曲专场。神曲有三种，一种像《凤凰传奇》，你能听懂也会唱；一种像《新贵妃醉酒》，你能听懂不一定会唱；还有一种像《忐忑》，你听不懂也不会唱。
比如：我家的狗名叫遛遛，每次我下楼遛狗碰到邻居，他们都对我说：“老铁，遛遛遛啊！”
甲说“我知道”，乙说“我知道你知道”，然后甲再说“我知道你知道我知道”，说的时候要动脑哟，看自己的脑袋转得有没有嘴巴快。

11　化用典故
典故，包括诗词、歇后语、俗语、名言等，指的是人人皆知的名句。
化用典故就是稍微改动一下典故，把一个常规的俗语变“歪”，让典故带上幽默色彩。
这些段子一般采用典故的前半句形成常规的期待，然后改写后半段，以出其不意的“歪理”来破坏听众的预期走向，从而形成笑点。因为典故深入人心，稍微改动一点点就会变得出人意料，带来好笑的效果。化用的典故一般语言仍然工整对仗，笑点和铺垫押韵，朗朗上口
例子：
善有善报，恶有恶报，不是不报，是你这个发票有点问题。
水能载舟，亦能煮粥。
是金子总会发光，是镜子总会反光。


12　词语拆分
有些词语固定搭配在一起的时候是一个意思，拆成单独的字又是另外一个意思。词语拆分的技巧，就是用词语首先形成一个有效的预期，然后把这个词语拆成一个个单独的字来进行细化描述，打破原有的预期，从而形成笑点。
词语拆分的技巧赋予了词语新的解释和含义，使人产生耳目一新的感觉
例子：
我们工作要100%投入，周一投入20%，周二投入20%，周三投入20%，周四投入20%，周五投入20%。
这句话的原意是鼓励大家工作要投入全部的精力。但经过以时间为线索的词语拆分，每天的100%，就成了5天的每天20%，用这种完全曲解原有意思的方法引发人的笑点。
有一次，美国舞蹈家邓肯和爱因斯坦碰面了。邓肯对爱因斯坦说：“如果我们结合会生一个最棒的孩子，我的身材，你的大脑。”


13　故意口误
生活中的口误常常令人忍俊不禁，但我们这里说的口误是一种故意操作。在一些特定场合下故意制造无伤大雅的小口误，会成为调节气氛、引人一笑的有效途径。因为根据幽默的机理，口误调动了听众的优越感。
例子：
去海边游泳，我跟我妈说：“你先别下水，太危险，我去给你租个花圈。”
在路上碰见一位老大爷在拧东西，本想帮他分担一下，一开口变成了：“老东西，大爷我帮你拧。”
有次我惹了我妈，我妈在揍我之前说了一句：“你别叫我妈，我没有你这样的妈。”
比如我的一名同学很喜欢这样介绍自己：我叫陈本东，我是从事人工智障，啊不，人工智能行业的。故意口误，当事人要表演出窘迫以及急于修正的急切，这些都能衬托出其他人的优越感，从而形成笑点。

14　先扬后抑
或者先抑后扬这个技巧前面提到过，就是先吹捧后打击，或者先打击后吹捧。
这两种方式都是很明显地跟对方开玩笑，需要你判断跟对方是不是熟悉，以及对方是不是开得起玩笑。
先抑后扬需要注意后面的夸奖要强过前面的冒犯，否则难免会让听者不舒服。这个技巧也可以用于说错话时救场。
例子：
先扬后抑：老婆问老公：如果有人拿1000万来买我，你卖不卖？老公：不卖啊！老婆非常开心地问：为什么？老公：昧良心的钱我不挣。老婆：你就是打着灯笼也找不到比我更好的了。老公：对对对，我就是打着灯笼才找到你的。老婆又非常开心。老公：我就是忘了睁眼睛。
先抑后扬：你根本不像个男人，你怎么会那么温柔！

15　亦正亦邪
在段子的创作技巧中，有一种我称其为亦正亦邪的技巧。用这种技巧创作的段子混合了褒贬两种语义，让人因捉摸不透而产生笑。
例子：
我们商学院的一个班在毕业典礼时，评了一个比较搞笑的奖叫“你最想与之共度春宵的男生”。结果是班长拿到了奖。
颁奖时，点评语是：“班长拿到了这个奖，充分说明男人的魅力真的不是看脸。”“男人的魅力真的不是看脸”这句话，混合了两种信息，既是赞美班长有魅力，也是吐槽班长长得丑，怎么理解都行。
这种混杂正面和负面评价的段子特别容易引起大笑。


"""